<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Import Red Giant's VFX Suite package into Munki</string>
	<key>Identifier</key>
	<string>com.github.jotai73.munki.vfxsuiteinstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VFXSuiteInstaller</string>
		<key>MUNKI_CATEGORY</key>
		<string>graphics</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Keying, tracking, cleanup, and visual effects compositing, right inside of After Effects</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Red Giant</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/graphics</string>
		<key>NAME</key>
		<string>VFXSuiteInstaller</string>
		<key>version</key>
		<string>%version%</string>
		<key>bundle_id</key>
		<string>%bundle_id%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>%MUNKI_DESCRIPTION%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>Red Giant VFX Suite Installer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jotai73.pkg.vfxsuiteinstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
			    <key>version</key>
				<string>%version%</string>
				<key>uninstall_script</key>
				<string>#!/bin/bash
		version="%version%"
		bundle_id="%bundle_id%"

		/Users/Shared/Red\ Giant/uninstall/uninstall-com.redgiant.vfx_v"${version}".sh
		pkgutil --forget "${bundle_id}"</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
